package textArray;

import javax.swing.*;

/**
 * Created by Zaven on 26.11.2016.
 */
public class TextArray {
    public static void main(String[] args) {
        JFrame frame = new JFrame("Zaven TEXT");
        frame.setSize(300,300);
        frame.setResizable(false);
//

//TEXT AREA
        JTextArea textArea = new JTextArea("Աշխատանքային օրը ավարտվեց\n" +
                " \n" +
                "— Կարծես թե գնացին, և շքամուտքի դուռն էլ կողպեցին։ Կարող էս հայտատարել բոլոր մատիտներին, որ հավաքվեն բաժնի վարիչի սեղանի վրա, և զգուշացրու, որ անխտիր ներկայանան, քանի որ շատ հետաքրքիր ու կարևոր հանդիպում պետք է լինի, — կարգադրեց հնաոճ արտաքինով տարեց մատիտը:\n" +
                " \n" +
                "Շատ չանցած նախագծային գրասենյակի բոլոր մատիտները հավաքվեցին սպիտակ թղթով ծածկված սեղանի վրա, որտեղ իրենց տերերը ընդմիջման ժամանակ ուտում էին ու զրուցում:\n" +
                " \n" +
                "Տարեց, հնաոճ մատիտը, որին բոլորը հարգանքով «հայրիկե էին անվանում, ոտքի ելավ ու ձեռքը բարձրացնելով խոսեց, ասելով.\n" +
                " \n" +
                "— Եղբայրներ, նախ զգուշացնեմ, որ անցյալ հավաքույթից հետո, մեր անփութության պատճառով մատիտահետքեր էին մնացել սեղանի վրա, և կասկածի տեղիք տվեց մեր տերերին, որ իրենց բացակայության ժամանակ այստեղ անց ու դարձ է լինում, այժմ զգույշ եղե՛ք և ոտքերով մի քստքստացրեք թղթի վրա, որ գծեր չառաջանան, իսկ վերջում դու՝ «կարճլիկե, կկանչես մեր բարեկամ ռետինին, որ կեղտոտված բծերը մաքրի։\n" +
                " \n" +
                "Եվ այսպես անցնենք բուն նյութին, ինչի համար որ հավաքվել ենք։ Չնայած ես թոշակի եմ անցել, և այժմ հազվագյուտ են ինձ օգտագործում, բայց ձեր բոլոր նեղություններին տեղյակ եմ ու գիտեմ, որ աշխատանքը դժվարացել է ու դուք հալումաշ էք եղել, և մեզանից շատերի կյանքը այնքան կարճացավ, որ աղբարկղ նետեցին։ Եթե այսպես շարունակվի, ապա շուտով մեր հետքն էլ չի մնա այս սենյակի թղթերի վրա։ Ես շատ մատիտների սերունդներ եմ տեսել, որովհետև իմ տերը դեռ վերջին պատերազմից է ինձ պահում, թե որպես հիշողություն, թե որպես «քիմիականե հազվագյուտ մատիտ չջընջվող հետքր թողնելու համար։ Բայց կարող եմ վկայել, որ այժմ մենք ապրում ենք անհանգիստ ու խառը ժամանակներում, մեզանից յուրաքանչյուրը չի կարողանում վստահություն ունենալ վաղվա օրվա վրա։ Եկեք խելք-խելքի, այսինքն գլուխ-գլխի տանք, որպեսզի որոշենք մեր հետագա անելիքը։ Ով առաջարկություն ունի, կարող է խոսել։ Դեռ տարեց մատիտը չվերջացրած, իսկույն ոտքի ցատկեց կրծմծած գըլխով մի անհրապույր մատիտ և սկսեց ճղճղալ սուր ձայնով.\n" +
                " \n" +
                "— Հարգելի աշխատակիցներ, խնդրում եմ ինձ ներել տգեղ արտաքինիս համար, քանի որ իմ տերը բարկացկոտ անձնավորություն է և հաճախ աշխատելու ժամանակ դժվարության հանդիպելիս զայրացած կծում է գլուխս, այդ պատճառով ես նրա նման ջղային եմ դարձել։ Ի՞նչ էի ուզում ասել, հա՛, հիշեցի, մարդիկ, որոնց մենք ծառայում ենք, նրանք շատ են փոխվել։ Օրինակ, իմ տերը առաջ շատ հազվագյուտ էր կծում գլուխս, բայց վերջերս զայրացած անընդհատ ցավեցնում է ինձ։ Չեմ հասկանում, ինչ է պատահել նրան, եթե ձեր հետ էլ է նույնը կատարվում, ասեք բոլորիս։\n" +
                " \n" +
                "— Այո՜, ճիշտ է ասում, — խոսեց բարալիկ իրանով մի մատիտ, — իմ տերն էլ է դարձել անհանգիստ, իհարկե, նա սովորություն չունի գլուխս կծելու, բայց երբեմն այնքան ուժեղ է ինձ սեղմում գծագրին, որ հաճախակի քիթս կոտրվում է, ու ստիպված շուտ-շուտ սրում է։ Տեսեք, ինչքան եմ մաշվել այս մի քանի ամսվա մեջ։\n" +
                " \n" +
                "— Իսկ ես զգացել եմ, որ ինձ օգտագործողի ձեռքերը սկսել են շատ դողալ, — ասաց կանաչավուն փայլով մատիտը, — առաջ էլ է այդպիսի բաներ եղել։ Երկուշաբթի օրը, երբ նա գալիս էր աշխատանքի, դեռ նախորդ օրվա հարբացությունը չանցած, բայց այժմ ամեն օր դողում են խեղճի ձեռքերը, երևի անընդհատ խմում է։\n" +
                " \n" +
                "— Բայց ի՞նչ կասեք այս մասին, որ արդեն մեկ շաբաթ է իմ տերը, մի քանի խզբզոցից բացի, ոչինչ չի արել, ու մտահոգ նստած մի կետի է նայում ու աննպատակ ինձ մատերի արանքում պտտեցնում, — հարցական բոլորին նայեց կապտավուն երանգով մատիտը։\n" +
                " \n" +
                "— Իմ տերը, ընդահակառակը, նույնիսկ երբեմն աշխատանքից հետո էլ մնում ու ինչ-որ բան գծագրում, կարծես օրվա աշխատանքը չի բավարարում, — ավելացրեց մեկ ուրիշը։ Հետո էլ վերջում, հոգնած ու գզգզված իր վիճակից, բարկացոտ ինձ շպրտում է ու քթի տակ ինքը իր հետ խոսելով գնում տուն։\n" +
                " \n" +
                "— Լսեցեք այժմ ինձ, — ասաց ոսկեգույն գծերով մի մատիտ, — ես առաջ ծառայում էի մի տիրոջ, որ նկարիչ էր ու գեղեցի՜կ-գեղեցի՜կ շատ բաներ էինք նկարում, օրինակ, ծաղիկներ, կենդանիներ ու շատ երեխաներ, և, մի խոսքով, այնպեսի բաներ, որ ձեզանից յուրաքանչյուր կերազեր։ Բայց մի օր էլ, տարօրինակ բաներ նկարել, իսկի ինքն էլ չէր հասկանում, թե ինչ ու երբ ցուցանհանդես տարավ ու գովեցին, նա շատ հպարտացավ ուսկսեց օրեցօր ավելի քիչ նկարել, իսկ նկարած էլ նույն տարօրինակություներ էին, որոնք մարդիկ կոչում են «աբստրակցիոնիզմե: Եվ երբ մի օր իր ընկերը ինձ տեսնելով, խնդրեց իրենից, նա էլ չմերժեց, ու ահա ես ձեզ մոտ հայտնվեցի: Միևնույնն է նա արդեն չէր կարողանում նկարել և կարծես, նրա միտքը դատարկվել էր, ու իսկապես, մարդկանց հետ ինչ-որ անհասկանալի բան է կատարվում, որ մենք չենք հասկանում :\n" +
                " \n" +
                "— Բա ի՞նչ անենք, հարկավոր է նրանց օգնել, թէ չէ այդպես մենք էլ նրանց հետ կկորչենք օրեցօր մարդկանց հետ տանջվելով, — ասաց կարճլիկ մատիտը, որ բոլորին հայտնի էր «մկնիկե անունով:\n" +
                " ");
        textArea.setSize(400,400);

        textArea.setLineWrap(true);
        textArea.setEditable(true);
        textArea.setVisible(true);

        JScrollPane scroll = new JScrollPane (textArea);
        scroll.setVerticalScrollBarPolicy(JScrollPane.VERTICAL_SCROLLBAR_ALWAYS);
        scroll.setHorizontalScrollBarPolicy(JScrollPane.HORIZONTAL_SCROLLBAR_ALWAYS);

        frame.add(scroll);
        frame.setVisible(true);
        frame.setDefaultCloseOperation(JFrame.EXIT_ON_CLOSE);
    }
}
